export default {
  label: "PM2.5", // ! Обязательное поле. Название
  unit: "μg/m3", // ! Обязательное поле. Единица измерения
  chartColor: "#89b268", // Цвет на графике
  range: [0, 50, 90], // диапозон значений для отображения цвета
  colors: ["#60bc2a", "#ff9d00", "#fc0202"], // диапозон цвета в зависимости от значения для отрисовки маркера на карте
  states: ["good", "attention", "danger", "neutral"], // состояние в зависимости от значения
  calculate: function (v) {
    // преобразование значения, например для приведения к нужной единице измерения, только для реалтайм
    return Number(v) * 2;
  },
  icon: "soap", // Иконка | на данный момент не используется
  info: "", // Описание | на данный момент не используется
};
